#!/usr/bin/env python3
# -*- coding: utf-8 -*-

################################################################################
#
# Author        : iaiting
#
# Contact       : iaiting@aliyun.com
#
# Generate Data : 2018-06-05
#
# Copyright     : 本文件隶属iaiting，欢迎转载无须知会
#
# Desciption    : Python基础教程（第2版）
#                 - 第 6 章 抽象
#
################################################################################

################################################################################
def chap0601_01(num):
    """
    斐波那契序列
    """
    print("chap0601_01 :")
    
    fibs = [0, 1]
    for _ in range(num - 2):
        fibs.append(fibs[-1] + fibs[-2])

    print(fibs)        
    print("")


################################################################################
def chap0601_02(name):    
    """
    定义函数
    """
    print("chap0601_02 :")

    print('Hello ' + name)
    print("")

################################################################################
def chap0601_03(num):
    """
    函数返回斐波那契序列
    """
    print("chap0601_03 :")

    fibs = [0, 1]
    for _ in range(num - 2):
        fibs.append(fibs[-1] + fibs[-2])

    return  fibs

################################################################################
def chap0601_04():
    """
    文档字符串
    计算x的平方
    """
    print("chap0601_04 :")
    print(chap0601_04.__doc__)


################################################################################
def chap0603_01():
    """
    没有返回值的函数实际返回的是None
    """
    print("chap0603_01 :")
    return

################################################################################
def chap0604_01(a):
    """
    形参为列表，是可以改变的
    """
    print("chap0604_01 :")
    print(a)
    a[0] = "changed"


################################################################################
def chap0604_02(greeting, name):
    print("chap0604_02 :")
    print("%s %s" % (greeting,name))
    print("")

################################################################################
def chap0604_03(arg, *args, **kwargs):
    print("chap0604_03 :")
    print("arg = ", arg)
    print("args = ", args)
    print("kwargs = ", kwargs)
    print("")


################################################################################
def main_chap06():
    chap0601_01(10)
    
    chap0601_02('abc')

    result = chap0601_03(15)
    print(result, '\n')

    chap0601_04()

    print(chap0603_01())
    print("")

    a = ['a', 'b', 'c']

    chap0604_01(a)
    print(a,'\n')

    chap0604_02("hello", "Alic")
    chap0604_02(name="Bob", greeting="hi")
    chap0604_02(greeting="hii", name="Hanmeimei")


    chap0604_03('abc', 1, 2, name='Alic', age=13)
    chap0604_03('abc', *(111,222), **{"name":'Alic', "age":13})


################################################################################
if __name__ == '__main__':
    main_chap06()
